In [65]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [66]:
#1
df.at[1,'FlightNumber'] = 1055.0
df.at[3,'FlightNumber'] = 1075.0
df['FlightNumber']=df['FlightNumber'].astype('int32')
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN          1055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          1075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [67]:
#2
contents = [i for i in df['From_To']]
From,To = [],[]
for i in contents:
    f,t = i.split('_')
    From.append(f)
    To.append(t)
d = {'From':From,'To':To}
df1 = pd.DataFrame(d)
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [68]:
#3
df1['From'] = [i.title() for i in df1['From']]
df1['To'] = [i.title() for i in df1['To']]
df1

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [69]:
#4
df.drop('From_To',axis=1,inplace=True)
df = pd.concat([df1,df],axis=1)
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan          1055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris          1075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [70]:
#5
dely = df['RecentDelays']
dely

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [80]:
#5 cont.
len_dely = []
for i in range(len(dely)):
    len_dely.append(len(dely[i]))
delay = {}
for i in range(1,max(len_dely)+1):
    delay["delay_{}".format(i)] = []
delay

{'delay_1': [], 'delay_2': [], 'delay_3': []}

In [87]:
#5 cont.
delays = [i for i in dely]
delays

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [91]:
for i in range(5):
    l = len(delays[i])
    if(l!=3):
        for _ in range(3-l):
            delays[i].append(np.nan)
delays

[[23, 47, nan], [nan, nan, nan], [24, 43, 87], [13, nan, nan], [67, 32, nan]]

In [92]:

for i in range(5):
    delay['delay_1'].append(delays[i][0])
    delay['delay_2'].append(delays[i][1])
    delay['delay_3'].append(delays[i][2])
delay

{'delay_1': [23, nan, 24, 13, 67],
 'delay_2': [47, nan, 43, nan, 32],
 'delay_3': [nan, nan, 87, nan, nan]}

In [93]:
df2 = pd.DataFrame(delay)
df2

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [95]:
df.drop('RecentDelays',axis=1,inplace=True)
df = pd.concat([df,df2],axis=1)
df

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,1055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,1075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN